# SpaceTag Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpaceTag Class
Members See Also
---
Provides access to the space tag in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SpaceTag : SpatialElementTag
```

Visual Basic
---
```text
Public Class SpaceTag _
	Inherits SpatialElementTag
```

Visual C++
---
```text
public ref class SpaceTag : public SpatialElementTag
```

# Remarks
The space Tag object can be queried for space information.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..SpatialElementTag Autodesk.Revit.DB.Mechanical..::..SpaceTag
# See Also
SpaceTag Members
Autodesk.Revit.DB.Mechanical Namespace